[
      
            {
              "id": 1,
              "title": "Chapitre 1",
              "text": "Dans un charmant village, deux frères forgerons commencent leur journée de travail. Jean-Pierre le premier frère va chercher des minéraux à la mine car il n’y en a plus à la forge. Mais après une heure, Jean-Pierre n’est toujours pas revenu. Et c’est à ce moment qu’un villageois informe le deuxième frère John que son frère s’est fait kidnapper par le maléfique Velkram. John prépare son sac à dos et prend son courage à deux mains pour aller sauver son frère du nécromancien. ",
              "choices": [
                { "id": 1, "text": "Continuer", "nextChapter": 2 }
               
              ]
            },
            {
                    "id": 2,
                    "title": "Chapitre 2",
                    "text": "John arrive aux portes du manoir de Velkram. Il entre le domaine maléfique et est immédiatement confronté à deux couloirs opposés menaçants. ",
                    "choices": [
                        { "id": 1, "text": "Couloir droit", "nextChapter": 3 },
                        { "id": 2, "text": "Couloir gauche", "nextChapter": 4 }
                    ]
                },
                {
                  "id": 3,
                    "title": "Chapitre 3a",
                    "text": "Vous arrivez dans un repaire de goblins. Cependant ils ont tous endormis. Que faites-vous? ",
                    "choices": [
                        { "id": 1, "text": " Battre les goblins avec votre force non subtile ", "nextChapter": 5 },
                        { "id": 2, "text": "Voler les armes des goblins pour vous enforcer ", "nextChapter": 6 },
                        { "id": 3, "text": "Passer discrètement les goblins ", "nextChapter": 7 }
                    ]
                },
                {
                  "id": 4,
                    "title": "Chapitre 3b",
                    "text": "Vous arrivez à une salle de coffres. Ceci est la chance parfaite d’acquérir de l’équipement de survie mais quelque chose semble ne tourner pas rond. Que faites-vous? ",
                    "choices": [
                        { "id": 1, "text": " Ouvrir un coffre", "nextChapter": 8 },
                        { "id": 1, "text": "Éviter les coffres et aller à la salle prochaine","nextChapter": 7 }
                    ]
                },
                {
                  "id": 5,
                    "title": "Chapitre 4a",
                    "text": "Vous attaquez les goblins mais votre tactique est maladroite et pathétique. Un sorcier goblin prend pitié de votre pitoyable incompétence et vous téléporte pour vous sauver. ",
                    "choices": [
                        { "id": 1, "text": "Téléporter", "nextChapter": 9 }
                    ]
                },
                {
                  "id": 6,
                    "title": "Chapitre 4b",
                    "text": "Vous volez l’épée suprême du maître goblin mais ceci le réveille. Tout à coup, une horde de goblins apparait et vous encerclent. Avec votre nouvelle arme, utiliser l’attaque spéciale : Tornade maléfique. ",
                    "choices": [
                        { "id": 1, "text": "Continuer", "nextChapter": 10 }
                    ]
                },
                {
                  "id": 7,
                    "title": "Chapitre 4c",
                    "text": "Vous trouvez une bibliothèque secrète contenant trois grimoires d’attributs légendaires. Vous pouvez choisir un des trois pour recevoir un pouvoir spécial. ",
                    "choices": [
                        { "id": 1, "text": "Continuer", "nextChapter": 11 }
                    ]
                },
                {
                  "id": 8,
                    "title": "Chapitre 4d",
                    "text": "Vous ouvrez le coffre et surprise : le coffre vous mort le bras. Défendez-vous! ",
                    "choices": [
                        { "id": 1, "text": "Continuer", "nextChapter": 11 }
                    ]
                },
                {
                  "id": 9,
                    "title": "Chapitre 5a",
                    "text": "Grâce à la pitié du sorcier goblin, vous êtes transporté à la salle d’armes des chef militaires de Velkram. Choisit une armure et une arme pour vous préparer au combat. ",
                    "choices": [
                        { "id": 1, "text": "Continuer", "nextChapter": 11 }
                    ]
                },
                {
                  "id": 10,
                    "title": "Chapitre 5b",
                    "text": "Puisque vous êtes faible, vous prenez énormément de temps pour battre les goblins. Après avoir fini, vous arrivez dans l’antre de Velkram, mais votre frère n’est plus. Velkram l’utlisait pour ramener un ancien démon à la vie. ",
                    "choices": [
                        { "id": 1, "text": "Continuer", "nextChapter": 11 }
                    ]
                },
                {
                  "id": 11,
                    "title": "Chapitre 5c",
                    "text": "L’heure est venue de vaincre le maléfique Velkram. Utilisez vos armes ou vos sortilèges pour prévenir la résurrection du démon antique. ",
                    "choices": [
                        { "id": 1, "text": "Choix 1", "nextChapter": 14 },
                        { "id": 2, "text": "Choix 2", "nextChapter": 14 },
                        { "id": 3, "text": "Choix 3", "nextChapter": 13 }
                    ]
                },
                {
                  "id": 12,
                    "title": "Chapitre 5d",
                    "text": "La mimique était plus fort que vous et vous a mangé.  ",
                    "choices": [
                        { "id": 1, "text": "Recommencer", "nextChapter": 1 }
                    ]
                },
                {
                  "id": 13,
                    "title": "Mauvaise fin",
                    "text": "Malgré vos meilleurs efforts, le plan du nécromancien a marché et vous devez affronter le démon.",
                    "choices": [
                        { "id": 1, "text": "Recommencer", "nextChapter": 1 }
                    ]
                },
                {
                  "id": 14,
                    "title": "Bonne fin",
                    "text": "Vous avez vaincu le sorcier ultime et vous êtes maintenant une légende digne de votre nom. ",
                    "choices": [
                        { "id": 1, "text": "Recommencer", "nextChapter": 1 }
                    ]
                }
   
]